return {
	hash=true,
	hashkeys={
		[1] = 1,[2] = 2,[3] = 3,[4] = 4,[5] = 5,[6] = 6,[7] = 7,[8] = 8,[9] = 9,[10] = 10,[11] = 11,[12] = 12,[13] = 13,[14] = 14,[15] = 15,[16] = 16,[17] = 17,[18] = 18,[19] = 19,[20] = 20,[21] = 21,[22] = 22,[23] = 23
	},
	--datakeyList={
		--"ID","Order","Career","Gender","Price","Condition","Att","ModelID","NameImg","Name","AttShow"
	--},
	datakeys={
		["ID"]=1,["Order"]=2,["Career"]=3,["Gender"]=4,["Price"]=5,["Condition"]=6,["Att"]=7,["ModelID"]=8,["NameImg"]=9,["Name"]=10,["AttShow"]=11
	},
	dataList = {
		{1,20,"0|1|2|3|4|5|6|7","0|1",168,0,"52-100|0-1000|1-1000",26,"ui_fashion_module40_shizhuang_11.png","蓮動亂紅","1%-攻擊百分比|1000-生命|1000-內力"},
		{2,21,"0|1|2|3|4|5|6|7","0|1",168,0,"53-200|4-1000|5-500",27,"ui_fashion_module40_shizhuang_12.png","劍嘯江湖","2%-防禦百分比|1000-命中|500-閃避"},
		{3,22,"0|1|2|3|4|5|6|7","0|1",168,0,"54-200|2-500|0-1000",32,"ui_fashion_module40_shizhuang_18.png","滄海笑傲","2%-命中百分比|500-攻擊|1000-生命"},
		{4,23,"0|1|2|3|4|5|6|7","0|1",168,0,"55-200|2-500|3-1000",33,"ui_fashion_module40_shizhuang_19.png","欺霜勝雪","2%-閃避百分比|500-攻擊|1000-防禦"},
		{5,24,"0|1|2|3|4|5|6|7","0|1",168,1,"50-100|52-100|53-100",22,"ui_fashion_module40_shizhuang_13.png","鬱綸袍","1%-生命百分比|1%-攻擊百分比|1%-防禦百分比"},
		{6,25,"0|1|2|3|4|5|6|7","0|1",168,1,"50-100|52-100|53-100",23,"ui_fashion_module40_shizhuang_14.png","青鋒寒","1%-生命百分比|1%-攻擊百分比|1%-防禦百分比"},
		{7,26,"0|1|2|3|4|5|6|7","0|1",168,0,"52-100|0-1000|3-1000",35,"ui_fashion_module40_shizhuang_26.png","迦葉問佛","1%-攻擊百分比|1000-生命|1000-防禦"},
		{8,1,"2","0",68,0,"2-100|3-100|0-200",36,"ui_fashion_module40_shizhuang_21.png","青龍出岫","100-攻擊|100-防禦|200-生命"},
		{9,2,"0","0",68,0,"2-100|3-100|0-200",37,"ui_fashion_module40_shizhuang_20.png","慈悲為懷","100-攻擊|100-防禦|200-生命"},
		{10,3,"5","1",68,0,"2-100|3-100|0-200",39,"ui_fashion_module40_shizhuang_25.png","離火玄冰","100-攻擊|100-防禦|200-生命"},
		{11,4,"7","0",68,0,"2-100|3-100|0-200",41,"ui_fashion_module40_shizhuang_22.png","垂髫瓔珞","100-攻擊|100-防禦|200-生命"},
		{12,5,"4","1",68,0,"2-100|3-100|0-200",45,"ui_fashion_module40_shizhuang_29.png","霜刀聽雪","100-攻擊|100-防禦|200-生命"},
		{13,6,"6","1",68,0,"2-100|3-100|0-200",46,"ui_fashion_module40_shizhuang_27.png","青丘狐火","100-攻擊|100-防禦|200-生命"},
		{14,7,"5","0",68,0,"2-100|3-100|0-200",67,"ui_fashion_module40_shizhuang_24.png","芝蘭玉樹","100-攻擊|100-防禦|200-生命"},
		{15,8,"7","1",68,0,"2-100|3-100|0-200",68,"ui_fashion_module40_shizhuang_23.png","豆蔻珠華","100-攻擊|100-防禦|200-生命"},
		{16,9,"3","1",68,0,"2-100|3-100|0-200",61,"ui_fashion_module40_shizhuang_28.png","紫萼流鶯","100-攻擊|100-防禦|200-生命"},
		{17,10,"4","0",68,0,"2-100|3-100|0-200",62,"ui_fashion_module40_shizhuang_30.png","丹墀龍吟","100-攻擊|100-防禦|200-生命"},
		{18,11,"1","0",68,0,"2-100|3-100|0-200",64,"ui_fashion_module40_shizhuang_31.png","皓首清歌","100-攻擊|100-防禦|200-生命"},
		{19,12,"1","1",68,0,"2-100|3-100|0-200",63,"ui_fashion_module40_shizhuang_32.png","輕黃淺黛","100-攻擊|100-防禦|200-生命"},
		{20,13,"6","0",68,0,"2-100|3-100|0-200",65,"ui_fashion_module40_shizhuang_33.png","業火長明","100-攻擊|100-防禦|200-生命"},
		{21,14,"2","1",68,0,"2-100|3-100|0-200",66,"ui_fashion_module40_shizhuang_34.png","月寒竹冷","100-攻擊|100-防禦|200-生命"},
		{22,37,"0|1|2|3|4|5|6|7","0|1",258,0,"0-2000|55-200|53-100",59,"ui_fashion_module40_shizhuang_35.png","龍驤九霄","2000-生命|2%-閃避百分比|1%-防禦百分比"},
		{23,38,"0|1|2|3|4|5|6|7","0|1",258,0,"0-2000|55-200|53-100",60,"ui_fashion_module40_shizhuang_36.png","虎嗥九野","2000-生命|2%-閃避百分比|1%-防禦百分比"}
	}
}