return {
	hash=true,
	hashkeys={
		["van_mail_no_rob"] = 1,["van_mail_rob_head"] = 2,["van_mail_rob_success_body"] = 3,["van_mail_rob_failure_body"] = 4,["van_mail_rob_lost_body"] = 5,["gang_mail_rank_title"] = 6,["gang_mail_rank_body"] = 7,["gang_mail_rank_body2"] = 8,["lamp1"] = 9,["lamp2"] = 10,["lamp3_1"] = 11,["lamp3_2"] = 12,["lamp4_1"] = 13,["lamp4_2"] = 14,["lamp4_3"] = 15,["lamp4_4"] = 16,["lamp4_5"] = 17,["lamp4_6"] = 18,["lamp5"] = 19,["lamp6"] = 20,["lamp7"] = 21,["lamp8_1"] = 22,["lamp8_2"] = 23,["lamp9"] = 24,["lamp10_1"] = 25,["lamp10_2"] = 26,["invite_bind_sender"] = 27,["invite_bind_title"] = 28,["invite_bind_content"] = 29,["month_card_sender"] = 30,["month_card_title"] = 31,["month_card_content_1"] = 32,["month_card_content_2"] = 33,["default_input"] = 34,["perm_card_sender"] = 35,["perm_card_title"] = 36,["perm_card_content_1"] = 37,["perm_card_content_2"] = 38,["forbit_login"] = 39,["forbit_speech"] = 40
	},
	--datakeyList={
		--"ID","Desc","Format2","Format"
	--},
	datakeys={
		["ID"]=1,["Desc"]=2,["Format2"]=3,["Format"]=4
	},
	dataList = {
		{"van_mail_no_rob","鏢車","風雨無阻，順利完成押鏢。","風雨無阻，順利完成押鏢。"},
		{"van_mail_rob_head","鏢車","<t fs=\"20\" tc=\"4C331FFF\">%v</t>","<t fs=\"20\" tc=\"4C331FFF\">%v</t>"},
		{"van_mail_rob_success_body","鏢車","您在<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>被<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>劫鏢，護鏢失敗!<b bs=\"1\"/>","您在<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>被<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>劫鏢，護鏢失敗!<b bs=\"1\"/>"},
		{"van_mail_rob_failure_body","鏢車","您在<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>被<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>劫鏢，護鏢成功!<b bs=\"1\"/>","您在<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>被<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>劫鏢，護鏢成功!<b bs=\"1\"/>"},
		{"van_mail_rob_lost_body","鏢車","損失<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>%v獎勵<b bs=\"1\"/>","損失<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>%v獎勵<b bs=\"1\"/>"},
		{"gang_mail_rank_title","幫派","門派地位變動","門派地位變動"},
		{"gang_mail_rank_body","幫派","在門派地位切磋中，您被%v擊敗，排名下降至第%v位。","在門派地位切磋中，您被%v擊敗，排名下降至第%v位。"},
		{"gang_mail_rank_body2","幫派","在門派地位切磋中，您被%v擊敗，排名已跌落榜外。","在門派地位切磋中，您被%v擊敗，排名已跌落榜外。"},
		{"lamp1","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>在藏寶閣中獲得紅階武學<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>，實力日進千裡！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>在藏寶閣中獲得紅階武學<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>，實力日進千里！</t>"},
		{"lamp2","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>在藏寶閣中獲得 <t fs=\"20\" t=\"紅階\" tc=\"6\" oc=\"6\" os=\"2\"/>百寶書匣，實力日進千裡！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>在藏寶閣中獲得 <t fs=\"20\" t=\"紅階\" tc=\"6\" oc=\"6\" os=\"2\"/>百寶書匣，實力日進千里！</t>"},
		{"lamp3_1","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">幫派攻掠戰正在緊張角逐，將於<t fs=\"20\" t=\"21點30分\" tc=\"6\" oc=\"6\" os=\"2\"/>揭曉戰果。</t>","<t fs=\"20\" tc=\"F6E3D0FF\">幫派攻掠戰正在緊張角逐，將於<t fs=\"20\" t=\"21點30分\" tc=\"6\" oc=\"6\" os=\"2\"/>揭曉戰果。</t>"},
		{"lamp3_2","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>幫派成功攻掠<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>城。</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>幫派成功攻掠<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>城。</t>"},
		{"lamp4_1","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"32\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"32\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>"},
		{"lamp4_2","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"16\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"16\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>"},
		{"lamp4_3","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"8\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"8\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>"},
		{"lamp4_4","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"4\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"4\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>"},
		{"lamp4_5","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"2\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">華山論劍<t fs=\"20\" t=\"2\" tc=\"6\" oc=\"6\" os=\"2\"/>強高手已出爐，歡迎各位俠友前往華山進行觀戰助威！</t>"},
		{"lamp4_6","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 奪得華山論劍冠軍，問鼎江湖，誰與爭鋒！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 奪得華山論劍冠軍，問鼎江湖，誰與爭鋒！</t>"},
		{"lamp5","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>獲得紅階武學<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>，實力日進千裡！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>獲得紅階武學<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>，實力日進千里！</t>"},
		{"lamp6","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>獲得紅階武器<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>，神兵在手，天下我有！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>獲得紅階武器<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>，神兵在手，天下我有！</t>"},
		{"lamp7","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>以武證道，接任<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>之位！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>以武證道，接任<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>之位！</t>"},
		{"lamp8_1","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 通過修羅塔 <t fs=\"20\" t=\"60\" tc=\"6\" oc=\"6\" os=\"2\"/> 層試煉，實力之強，有目共睹！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 通過修羅塔 <t fs=\"20\" t=\"60\" tc=\"6\" oc=\"6\" os=\"2\"/> 層試煉，實力之強，有目共睹！</t>"},
		{"lamp8_2","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 通過修羅塔 <t fs=\"20\" t=\"終極試煉（通關所有層）\" tc=\"6\" oc=\"6\" os=\"2\"/>，登臨武道之絕頂！</t>","<t fs=\"20\" tc=\"F6E3D0FF\">恭喜 <t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/> 通過修羅塔 <t fs=\"20\" t=\"終極試煉（通關所有層）\" tc=\"6\" oc=\"6\" os=\"2\"/>，登臨武道之絕頂！</t>"},
		{"lamp9","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>於比武擂臺橫掃四合，罕逢敵手，榮登第<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>位！</t>","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>於比武擂臺橫掃四合，罕逢敵手，榮登第<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>位！</t>"},
		{"lamp10_1","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>苦心孤詣，將<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>推至第<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>層境界，臻於化境！</t>","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>苦心孤詣，將<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>推至第<t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>層境界，臻於化境！</t>"},
		{"lamp10_2","走馬燈","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>苦心孤詣，將<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>推至第<t fs=\"20\" t=\"十層(滿層)\" tc=\"6\" oc=\"6\" os=\"2\"/>境界，妙入毫顛！</t>","<t fs=\"20\" tc=\"F6E3D0FF\"><t fs=\"20\" t=\"%v\" tc=\"6\" oc=\"6\" os=\"2\"/>苦心孤詣，將<t fs=\"20\" t=\"《%v》\" tc=\"6\" oc=\"6\" os=\"2\"/>推至第<t fs=\"20\" t=\"十層(滿層)\" tc=\"6\" oc=\"6\" os=\"2\"/>境界，妙入毫顛！</t>"},
		{"invite_bind_sender","攜手江湖","系統","系統"},
		{"invite_bind_title","攜手江湖","攜手江湖","攜手江湖"},
		{"invite_bind_content","攜手江湖","恭喜您與好友%v綁定成功，攜手江湖！","恭喜您與好友%v綁定成功，攜手江湖！"},
		{"month_card_sender","月卡","系統","系統"},
		{"month_card_title","月卡","月卡收益","月卡收益"},
		{"month_card_content_1","月卡","今日月卡收益%v元寶，剩餘%v天！","今日月卡收益%v元寶，剩餘%v天！"},
		{"month_card_content_2","月卡","今日月卡收益%v元寶，首沖贈送%v元寶，剩餘%v天！","今日月卡收益%v元寶，首衝贈送%v元寶，剩餘%v天！"},
		{"default_input","登錄註冊界面輸入框默認文字","最少6個字母或數字","最少6個字母或數字"},
		{"perm_card_sender","終身卡","系統","系統"},
		{"perm_card_title","終身卡","終身卡收益","終身卡收益"},
		{"perm_card_content_1","終身卡","今日終身卡收益%v元寶！","今日終身卡收益%v元寶！"},
		{"perm_card_content_2","終身卡","今日終身卡收益%v元寶，首沖贈送%v元寶","今日終身卡收益%v元寶，首衝贈送%v元寶"},
		{"forbit_login","封號提示","很抱歉，你的帳號已被鎖定，剩餘封鎖時間a分鐘","很抱歉，你的帳號已被鎖定，剩餘封鎖時間a分鐘"},
		{"forbit_speech","禁言提示","很抱歉，你的帳號已被禁言，剩餘封鎖時間a分鐘","很抱歉，你的帳號已被禁言，剩餘封鎖時間a分鐘"}
	}
}