return {
	hash=true,
	hashkeys={
		[1] = 1,[2] = 2,[3] = 3,[4] = 4,[5] = 5,[6] = 6,[7] = 7,[8] = 8,[9] = 9,[10] = 10,[11] = 11,[12] = 12,[13] = 13,[14] = 14,[15] = 15
	},
	--datakeyList={
		--"ID","Accu","Limit","Item","Desc","Condition","Name"
	--},
	datakeys={
		["ID"]=1,["Accu"]=2,["Limit"]=3,["Item"]=4,["Desc"]=5,["Condition"]=6,["Name"]=7
	},
	dataList = {
		{1,20,20,"2-6000","進行20次劇情關卡挑戰",2,"劇情通關"},
		{2,10,3,"2-3000","進行3次祕境挑戰",2,"祕境挑戰"},
		{3,20,1,"2-3000","進行1次藏寶閣抽獎",1,"高閣尋寶"},
		{4,10,5,"2-3000","進行5次武學升級",1,"升級武學"},
		{5,10,10,"2-6000","進行10次門派修煉",1,"門派修煉"},
		{6,10,1,"2-3000","進行1次快速歷練",1,"快速歷練"},
		{7,20,5,"2-6000","進行5次比武場挑戰",1,"擂臺比武"},
		{8,20,3,"2-6000","進行3次門派地位挑戰",1,"強者居上"},
		{9,20,1,"2-3000","在醉仙樓進行1次斗酒玩法",1,"划拳行酒"},
		{10,20,3,"2-3000","在長樂坊進行3次搖骰玩法",1,"賭彩一擲"},
		{11,20,9,"2-6000","進行9次江湖豪傑切磋",2,"江湖切磋"},
		{12,20,5,"2-6000","進行5次押鏢",1,"鏢行天下"},
		{13,10,3,"2-3000","進行3次江湖事件",1,"懲惡揚善"},
		{14,10,1,"2-3000","進行1次體力購買",1,"購買體力"},
		{15,20,1,"2-10000","進行1次儲值",1,"遊戲儲值"}
	}
}