return {
	hash=true,
	hashkeys={
		[1] = 1,[2] = 2,[3] = 3,[4] = 4,[5] = 5,[6] = 6,[7] = 7,[8] = 8,[9] = 9,[10] = 10
	},
	--datakeyList={
		--"ID","Type","Core","Name","Award","BufferID","Hp","Pos","IconNormal","IconBroken","BrokenReward","MailAward"
	--},
	datakeys={
		["ID"]=1,["Type"]=2,["Core"]=3,["Name"]=4,["Award"]=5,["BufferID"]=6,["Hp"]=7,["Pos"]=8,["IconNormal"]=9,["IconBroken"]=10,["BrokenReward"]=11,["MailAward"]=12
	},
	dataList = {
		{1,1,1,"俠客堂","608-20|609-20","",30,"389-711|360-158","ui_zlzc_module83_zlzc_xkt_1.png","ui_zlzc_module83_zlzc_xkt_2.png","全陣營俠客各獲得2000元寶\n全陣營俠客各獲得10天書殘頁","17-3|1463-1|812-1|611-5"},
		{2,1,0,"聚義廳","608-20","",10,"132-799|120-242","ui_zlzc_module83_zlzc_jyt_1.png","ui_zlzc_module83_zlzc_jyt_2.png","全陣營獲得血怒狀態(造成傷害提高15%)\n全陣營俠客各獲得500元寶","602-1|7-5|183-3|11-3"},
		{3,1,0,"糧倉","608-20","",10,"240-952|219-394","ui_zlzc_module83_zlzc_lc_1.png","ui_zlzc_module83_zlzc_lc_2.png","全陣營獲得血怒狀態(造成傷害提高15%)\n全陣營俠客各獲得500元寶","1471-1|812-1|1479-1|12-3"},
		{4,1,0,"練功房","608-20","",10,"466-918|466-380","ui_zlzc_module83_zlzc_lgf_1.png","ui_zlzc_module83_zlzc_lgf_2.png","全陣營獲得荊棘狀態(反彈20%的傷害)\n全陣營俠客各獲得500元寶","1469-1|611-10|8-3|13-3"},
		{5,1,0,"兵器庫","608-20","",10,"607-768|591-217","ui_zlzc_module83_zlzc_bqk_1.png","ui_zlzc_module83_zlzc_bqk_2.png","全陣營獲得鐵甲狀態(承受傷害減少20%)\n全陣營俠客各獲得500元寶","812-2|615-2|185-3|18-3"},
		{6,2,1,"六扇門","608-20|609-20","",30,"382-412|399-923","ui_zlzc_module83_zlzc_lsm_1.png","ui_zlzc_module83_zlzc_lsm_2.png","全陣營俠客各獲得2000元寶\n全陣營俠客各獲得10天書殘頁","602-3|7-5|812-1|357-5"},
		{7,2,0,"議事廳","608-20","",10,"124-340|135-870","ui_zlzc_module83_zlzc_yst_1.png","ui_zlzc_module83_zlzc_yst_2.png","全陣營獲得血怒狀態(造成傷害提高15%)\n全陣營俠客各獲得500元寶","611-5|7-5|183-3|11-3"},
		{8,2,0,"兵甲坊","608-20","",10,"164-133|172-696","ui_zlzc_module83_zlzc_bjg_1.png","ui_zlzc_module83_zlzc_bjg_2.png","全陣營獲得飲血狀態(回覆造成傷害25%的生命值)\n全陣營俠客各獲得500元寶","812-3|7-5|615-1|183-3"},
		{9,2,0,"校場","608-20","",10,"419-151|419-701","ui_zlzc_module83_zlzc_jc_1.png","ui_zlzc_module83_zlzc_jc_2.png","全陣營獲得荊棘狀態(反彈20%的傷害)\n全陣營俠客各獲得500元寶","603-3|1471-1|812-1|7-10"},
		{10,2,0,"演武閣","608-20","",10,"600-235|588-773","ui_zlzc_module83_zlzc_ywg_1.png","ui_zlzc_module83_zlzc_ywg_2.png","全陣營獲得鐵甲狀態(承受傷害減少20%)\n全陣營俠客各獲得500元寶","611-10|812-2|17-3|12-3"}
	}
}