return {
	hash=false,
	hashkeys={
		
	},
	--datakeyList={
		--"Type","SubType","SubTypeName","Desc","Hierarchy","Level"
	--},
	datakeys={
		["Type"]=1,["SubType"]=2,["SubTypeName"]=3,["Desc"]=4,["Hierarchy"]=5,["Level"]=6
	},
	dataList = {
		{1,1,"裝備提升","<t fs=\"20\" tc=\"4C331FFF\">\n更換更好的裝備或者對裝備進行強化、熔鑄能夠大幅度提升人物屬性。\n</t>",0,1},
		{1,2,"武學提升","<t fs=\"20\" tc=\"4C331FFF\">\n對武學進行突破、升級、境界提升和裝備招式能夠有效提升武學戰鬥力。\n</t>",0,1},
		{1,3,"門派提升","<t fs=\"20\" tc=\"4C331FFF\">\n在門派中進行門派修煉、門派進階以及學習門派武學能夠提升自身戰鬥力。\n</t>",0,1},
		{1,4,"混元提升","<t fs=\"20\" tc=\"4C331FFF\">\n裝備混元能夠直接提升角色屬性，還能觸發套裝效果提升戰鬥屬性。\n</t>",3,0},
		{1,5,"時裝提升","<t fs=\"20\" tc=\"4C331FFF\">\n獲取時裝能夠直接獲得永久角色屬性加成。\n</t>",0,1},
		{1,6,"等級提升","<t fs=\"20\" tc=\"4C331FFF\">\n通關主線關卡能夠獲得大量升級所需閱歷。\n</t>",0,1},
		{2,1,"招財","<t fs=\"20\" tc=\"4C331FFF\">\n花費少量元寶換取大量金錢，連續招財還能進行打折。\n</t>",0,1},
		{2,2,"長樂坊","<t fs=\"20\" tc=\"4C331FFF\">\n在長樂坊遊玩能夠獲得大量金錢獎勵。\n</t>",0,1},
		{2,3,"祕境","<t fs=\"20\" tc=\"4C331FFF\">\n通關吉祥賭坊祕境能夠獲得鉅額金錢獎勵。\n</t>",0,3},
		{2,4,"押鏢","<t fs=\"20\" tc=\"4C331FFF\">\n在龍門鏢局進行押鏢能夠獲得大量金錢獎勵。\n</t>",0,4},
		{2,5,"江湖豪傑","<t fs=\"20\" tc=\"4C331FFF\">\n戰勝江湖豪傑能夠獲得大量金錢獎勵。\n</t>",0,4},
		{3,1,"參悟","<t fs=\"20\" tc=\"4C331FFF\">\n花費少量元寶換取大量修為，參悟等級越高參悟獲取的修為越多。\n</t>",0,1},
		{3,2,"幫會商店","<t fs=\"20\" tc=\"4C331FFF\">\n在幫會商店能夠消耗幫貢換取大量修為。\n</t>",0,1},
		{3,3,"祕境","<t fs=\"20\" tc=\"4C331FFF\">\n通關弘武會館祕境能夠獲得鉅額修為獎勵。\n</t>",0,3},
		{4,1,"歷練","<t fs=\"20\" tc=\"4C331FFF\">\n歷練能夠持續性地獲取裝備，進行快速歷練能夠快速獲得大量裝備。\n</t>",0,2},
		{4,2,"祕境","<t fs=\"20\" tc=\"4C331FFF\">\n通關離火劍冢祕境能夠獲取極品裝備獎勵。\n</t>",0,3},
		{4,3,"江湖豪傑","<t fs=\"20\" tc=\"4C331FFF\">\n挑戰江湖豪傑能夠獲得極品裝備獎勵。\n</t>",0,4},
		{4,4,"聲望商店","<t fs=\"20\" tc=\"4C331FFF\">\n在聲望商店消耗聲望值能夠兌換極品裝備。\n</t>",0,1},
		{5,1,"藏寶閣","<t fs=\"20\" tc=\"4C331FFF\">\n在藏寶閣中耗費元寶或金錢能夠獲得大量武學獎勵。\n</t>",0,1},
		{5,2,"門派","<t fs=\"20\" tc=\"4C331FFF\">\n達成修習條件能夠在門派中能學習到各個品質的門派武學。\n</t>",0,1},
		{5,3,"主線","<t fs=\"20\" tc=\"4C331FFF\">\n通關主線關卡能夠獲得各個品質的江湖武學。\n</t>",0,1},
		{5,4,"商店","<t fs=\"20\" tc=\"4C331FFF\">\n在各個商店消耗各自對應的資源能夠兌換到各個品質的武學。\n</t>",0,1},
		{6,1,"主線","<t fs=\"20\" tc=\"4C331FFF\">\n通關主線關卡能夠獲得武學突破材料獎勵。\n</t>",0,1},
		{6,2,"祕境","<t fs=\"20\" tc=\"4C331FFF\">\n通關各類祕境能夠獲得各種材料獎勵。\n</t>",0,3},
		{6,3,"江湖豪傑","<t fs=\"20\" tc=\"4C331FFF\">\n挑戰江湖豪傑有一定概率能夠獲得材料獎勵。\n</t>",0,4},
		{6,4,"商店","<t fs=\"20\" tc=\"4C331FFF\">\n在各個商店消耗各自對應的資源能夠兌換到各種材料。\n</t>",0,1}
	}
}